Revit 2024 API
ZoneEquipmentData.EquipmentBehavior Property
 The behavior of how zone equipment is allocated with assigned spaces.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020.1
Syntax
C#
public ZoneEquipmentBehavior EquipmentBehavior { get; set; }
Visual Basic
Public Property EquipmentBehavior As ZoneEquipmentBehavior
	Get
	Set
Visual C++
public:
property ZoneEquipmentBehavior EquipmentBehavior {
	ZoneEquipmentBehavior get ();
	void set (ZoneEquipmentBehavior value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
ZoneEquipmentData Class
Autodesk.Revit.DB.Mechanical Namespace